# *******************************************************************************************************
# Селетков И.П. 2018 0417.                                                                              *
# Класс с реализацией действий над нечёткими векторами.                                                 *
# *******************************************************************************************************


class CFuzzyVector:
    # ***************************************************************************************************
    # Конструктор.                                                                                      *
    # @param x - степень истинности.                                                                    *
    # ***************************************************************************************************
    def __init__(self, x=0):
        self.x = x

    # ***************************************************************************************************
    # Конъюнкция двух векторов.                                                                         *
    # @param other - вектор, между которым и текущим производится операция.                             *
    # @return - новый вектор с результатом операции.                                                    *
    # ***************************************************************************************************
    def c(self, other):
        return CFuzzyVector(self.x*other.x)

    # ***************************************************************************************************
    # Дизъюнкция двух векторов.                                                                         *
    # @param other - вектор, между которым и текущим производится операция.                             *
    # @return - новый вектор с результатом операции.                                                    *
    # ***************************************************************************************************
    def d(self, other):
        return CFuzzyVector(1 - self.x * other.x)

    # ***************************************************************************************************
    # Обратная импликация двух векторов.                                                                *
    # @param other - вектор, между которым и текущим производится операция.                             *
    # @return - новый вектор с результатом операции.                                                    *
    # ***************************************************************************************************
    def i1(self, other):
        value = self.x+other.x-1
        if value < 0:
            value = 0

        return CFuzzyVector(value)
